app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2019-09-04 13:40:12.972382"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.title = params[:title]
    @article.description = params[:description]
    @article.update